/*=============================================================================
/*-----------------------------------------------------------------------------
/*	[JSONManager.cpp] JSON管理クラス
/*	Author：Kousuke,Ohno.
/*-----------------------------------------------------------------------------
/*	説明：JSON管理クラス
=============================================================================*/

/*--- インクルードファイル ---*/
#include "StdAfx.h"
#include "JSONManager.h"

#include "DebugSystem.h"

#include <fstream>


/*-----------------------------------------------------------------------------
/* コンストラクタ
-----------------------------------------------------------------------------*/
JSONManager::JSONManager(void)
{
}

/*-----------------------------------------------------------------------------
/* デストラクタ
-----------------------------------------------------------------------------*/
JSONManager::~JSONManager(void)
{
}

/*-----------------------------------------------------------------------------
/* JSONファイルへの読み込み処理
-----------------------------------------------------------------------------*/
bool JSONManager::LoadJSON(const std::string& inFileName, rapidjson::Document& outDoc)
{
	//読み込み専用でファイルを開く
	std::ifstream ifs(inFileName.c_str()
				   	 , std::ios::in      //読み取り専用モードで起動
				   	 | std::ios::binary  //バイナリモードで
				   	 | std::ios::ate);   //ファイルサイズを知るためにシークをファイル内のデータ末尾へ
	
	if (!ifs.is_open())
	{
		std::cout << OUTPUT_ERROR_STRING("File is not found :" + inFileName);
		return false;
	}



}

/*-----------------------------------------------------------------------------
/* JSONファイルへの保存処理
-----------------------------------------------------------------------------*/
void JSONManager::SaveJSON(const std::string& inFileName)
{
}

/*-----------------------------------------------------------------------------
/* JSONファイルの新規作成
-----------------------------------------------------------------------------*/
void JSONManager::GenarateNewJSONFile(const std::string& inFileName)
{

	std::ofstream ofs(inFileName);
	if (!ofs)
	{
		std::cout << OUTPUT_ERROR_STRING("ファイルが開けませんでした");
		std::cin.get();
		return ;
	}

}

/*=============================================================================
/*		End of File
=============================================================================*/