/*=============================================================================
/*-----------------------------------------------------------------------------
/*	[StdAfx.h] 標準拡張フレームワーク
/*	Author：Kousuke,Ohno.
/*-----------------------------------------------------------------------------
/*	説明：ファイルのインクルードなど
=============================================================================*/
#ifndef STDAFX_H_
#define	STDAFX_H_

#define _CRT_SECURE_NO_WARNINGS

/*--- インクルードファイル ---*/
#include <iostream>
#include <fstream>
#include <string>
#include <functional>
#include <vector>
#include <list>
#include <map>
#include <unordered_map>


/*--- 構造体定義 ---*/

/*--- クラスの前方宣言 ---*/



#endif //STDAFX_H_
/*=============================================================================
/*		End of File
=============================================================================*/